Tekla.Structures.DialogInternal.UnitOperationEnum
Unit operations

Tekla.Structures.DialogInternal.UnitOperationEnum.GetUnitLabel
Get unit label

Tekla.Structures.DialogInternal.UnitOperationEnum.FormatDoubleValue
Format double value

Tekla.Structures.DialogInternal.UnitOperationEnum.FormatDoubleValueIncludeLabel
Format double value, with label

Tekla.Structures.DialogInternal.UnitOperationEnum.ParseDoubleValue
Parse double value

Tekla.Structures.DialogInternal.UnitOperationEnum.GetUnitDecimals
Get unit decimal count

Tekla.Structures.DialogInternal.UnitOperationEnum.SetUnitDecimals
Set unit decimal count